Merge pull request #5 from picalexs/smau
Timestamps extraction & Dashboard
